Week8/C_SimpleHeatExchangers/Ca_simpleCoCurrentHeatExchanger/0.org/fluidA/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluidA";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inletA
    {
        type            zeroGradient;
    }
    outletA
    {
        type            fixedValue;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    fluidA_to_solidWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
