Week8/C_SimpleHeatExchangers/Ca_simpleCoCurrentHeatExchanger/0.org/solidWall/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/solidWall";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            calculated;
        value           uniform 100000;
    }
    solidWall_to_fluidA
    {
        type            calculated;
        value           uniform 100000;
    }
    solidWall_to_fluidB
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
