Week8/C_SimpleHeatExchangers/Ca_simpleCoCurrentHeatExchanger/constant/fluidA/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

//dpdt    no;

mixture
{
    specie
    {
        nMoles      1;
        molWeight   18.015;
    }
    thermodynamics
    {
        Cp          4184;
        Hf          0;
    }
    equationOfState
    {
        rho        1000;
    }
    transport
    {
        mu          0.001;
        Pr          7;
    }
}


// ************************************************************************* //
