Week8/C_SimpleHeatExchangers/Ca_simpleCoCurrentHeatExchanger/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)    //Bottom channel
    (1 0 0)
    (1 0.01 0)
    (0 0.01 0)
    (0 0 0.001)
    (1 0 0.001)
    (1 0.01 0.001)
    (0 0.01 0.001)
    
    (0 0.02 0)     //Top channel
    (1 0.02 0)
    (1 0.04 0)
    (0 0.04 0)
    (0 0.02 0.001)
    (1 0.02 0.001)
    (1 0.04 0.001)
    (0 0.04 0.001)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) fluidA (100 10 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 13 12) solidWall (100 10 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) fluidB (100 20 1) simpleGrading (1 1 1)
);


edges
(
);


defaultPatch
{
    name    walls;
    type    wall;
}


boundary
(
    inletA
    {
        type    patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outletA
    {
        type    patch;
        faces
        (
            (1 2 6 5)
        );
    }
    inletB
    {
        type    patch;
        faces
        (
            (8 12 15 11)
        );
    }
    outletB
    {
        type    patch;
        faces
        (
            (9 10 14 13)
        );
    }
    frontAndBack
    {
        type    empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (3 8 9 2)
            (7 6 13 12)
            (8 11 10 9)
            (12 13 14 15)
        );
    }
);


mergePatchPairs
(
);


// ************************************************************************* //
